help_text = '''
Бот скидывает билеты по истории если ему написать Билет (номер билета).
Пример: Билет 1
Также допустимо БиЛет 1
Результат будет тот же.
Если перед билетом написать букву Б то бот скинет билет на белорусском языке.
Также можно изменить клавиатуру под белорусские билеты  и на оборот.
Команду для этого можно посмотреть через /commands'''

commands_text = '''
<b>/help</b> - <em>Инструкция по использыванию бота</em>
<b>/commands</b> - <em>Список команд</em>
<b>/website</b> - <em>Ссылка на сайт с тестами</em>
<b>/time</b> - <em>Узнать сколько дней осталось до экзамена</em>
<b>/by</b> - <em>Изменить клавиатуру для белорусских билетов</em>
<b>/ru</b> - <em>Изменить клавиатуру для русских билетов</em>
'''

start_text = '''
Привет: <b><em>{name}</em></b>
<b>Я телеграм бот предназначенный для того чтобы облегчить доступ к билетам.</b>
Всего-то надо написать Билет (номер билета). 
Пример: Билет 1
<b>Если после номера билета добавить букву Б то билет будет на Белорусском языке.</b>
Пример: Билет 1 Б'''

