TESTS: dict[str, dict[str, str]] = {
    'ticket 1': {
                 'question 1': '<b>Когда произошло заселение территории, которая сейчас является Беларусью, древними людьми?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) Примерно в 15 веке н.э.\n'
                 'b) В эпоху верхнего палеолита, около 40 000-30 000 лет назад.\n'
                 'c) В 10 веке н.э.',
                 
                'question 2':'<b>Какие занятия были основными для древних людей, живших на территории Беларуси?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Рыболовство и собирательство пищи.\n'
                'b) Охота и сельское хозяйство.\n'
                'c) Торговля и ремесла.',
                 
                'question 3': '<b>Какие основные изобретения и открытия сделали древние люди на территории Беларуси?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Паровой двигатель и электричество.\n'
                'b) Каменные орудия и керамика.\n'
                'c) Радио и телевидение.',
                 
                'question 4': '<b>Какие религиозные верования были распространены у древних людей на территории Беларуси?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Христианство и ислам.\n'
                'b) Поклонение природным силам и духам предков.\n'
                'c) Буддизм и индуизм.',
                 
                'question 5': '<b>Какое значение имели природные объекты и священные места в религиозных верованиях древних людей Беларуси?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Не имели никакого значения.\n'
                'b) Были местами для отдыха и развлечений.\n'
                'c) Считались святыми и использовались для проведения ритуалов и обрядов.'
                },
    
    'ticket 2': {
                'question 1': '<b>Какое важное событие произошло в 862 году с участием варягов и как оно связано с возникновением Киевской Руси?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Появление первого полоцкого князя.\n'
                'b) Крещение Руси.\n'
                'c) Призвание варягов на Русь, что стало началом Киевской Руси.\n',
                 
                'question 2': '<b>Каким образом географическое положение Полоцка способствовало его быстрому росту и превращению в крупный торговый и ремесленный город Киевской Руси?</b>\n'
                'a) Полоцк был городом с исключительно удобным климатом и богатыми природными ресурсами.\n'
                'b) Город располагался на реке Западная Двина и на важнейшем торговом пути "Из Варяг в Греки", что способствовало торговле и экономическому росту.\n'
                'c) Полоцк был центром добычи меди и олова, что обеспечивало городу процветание.\n',
                 
                'question 3': '<b>Почему Всеслав Чародей был прозван "Чародеем" и какие легенды сопровождали его личность?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Он был известным колдуном и оборотнем.\n'
                'b) Ему приписывали способность обращаться в зверя.\n'
                'c) Он родился с помощью и в результате колдовства.\n',
                 
                'question 4': '<b>Каким образом сочеталась система княжеского правления и власть вече в Полоцке, и какие функции выполняло вече?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Вече решало вопросы об освобождении рабов и образовании войск.\n'
                'b) Князь решал важные государственные вопросы, а вече занималось командованием войском.\n'
                'c) Система княжеского правления сочеталась с властью вече, которое решало важные государственные вопросы и объявляло войны.\n',
                 
                'question 5': '<b>Какое географическое положение имело Туровское княжество и как оно зависело от Киевской Руси?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Туровское княжество располагалось в северной части Беларуси и было независимым государством.\n'
                'b) Туровское княжество находилось на территории современного Полесья и оставалось в серьезной зависимости от Киева.\n'
                'c) Туровское княжество было известно своей независимостью от Киевской Руси и претендовало на лидерство в регионе.\n'
                },
    
    'ticket 3': {
                'question 1': '<b>Какие факторы способствовали принятию христианства на Киевской Руси, и какие последствия оно имело?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Экономические связи с Европой и желание Киевских князей усилить свою политическую позицию. Это привело к изменениям в жизни государства и общества, распространению христианства и соседствованию христианства и язычества.\n'
                'b) Принятие христианства с целью укрепления экономических отношений с Византией и уменьшения местных обрядов.\n'
                'c) Воздействие других европейских стран и внутренние религиозные конфликты. Последствиями стали культурные и религиозные изменения в Руси.',

                'question 2': '<b>Какие источники и материалы свидетельствуют о развитии письменности?</b>\n'
                'Выберите вариант ответа:\n'
                'a) "Борисовы камни" и "Рогволодов камень" подтверждают развитие письменности. Гребни с буквами алфавита поддерживают кириллицу.\n'
                'b) Берестяные грамоты, найденные под Витебском и Мстиславлем, документируют развитие письменности.\n'
                'c) Полоцкое евангелие, Туровское евангелие и "Повесть временных лет" свидетельствуют о развитии письменности в XI веке и позже.',

                'question 3': '<b>Какие религиозные просветители способствовали распространению христианства и развитию письменности?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Ефросинья Полоцкая основала монастыри, школы и организовала переписывание церковных книг.\n'
                'b) Туровский епископ Кирилл был известным проповедником и написал молитвы и притчи.\n'
                'c) Оба варианта ответа верны.',

                'question 4': '<b>Как христианство способствовало развитию архитектуры на Киевской Руси?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Софийский собор в Полоцке и Спасская церковь, построенные в этот период, являются примерами каменного зодчества.\n'
                'b) Коложская церковь в Гродно была украшена вставками из цветного камня и керамическими плитками, а Каменецкая башня в Брестской области является памятником оборонительного зодчества.\n'
                'c) Все варианты ответа верны.',

                'question 5': '<b>Какое воздействие оказало христианство на культурный подъем белорусских земель?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Христианство способствовало развитию письменности, массовому строительству каменных сооружений и просветительской деятельности на Белорусских землях.\n'
                'b) Христианство привело к конфликтам и культурным изменениям в Руси.\n'
                'c) Воздействие христианства на культурный подъем не было значительным.\n'
                },
    
    'ticket 4': {
                'question 1': '<b>Какие причины способствовали образованию Великого Княжества Литовского (ВКЛ) в XIII веке?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Феодальная раздробленность и угроза со стороны крестоносцев и монголов.\n'
                'b) Экономическая необходимость развития торговли и связей между княжествами.\n'
                'c) Этнические процессы и сближение славянских и балтских племен.',

                'question 2': '<b>Какие концепции образования Великого Княжества Литовского существовали?</b>\n'
                'Выберите вариант ответа:\n'
                'a) "Литовское завоевание", где литовские князья играли важную роль.\n'
                'b) "Белорусская держава", признавающая белорусские земли центром ВКЛ.\n'
                'c) "Полиэтническое государство", утверждающее белорусско-литовское содружество.',

                'question 3': '<b>Какой князь стал первым Великим Князем Литовским и какие территории включил в состав ВКЛ?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Первым Великим Князем стал Миндовг, который включил Полоцкое княжество.\n'
                'b) Первым Великим Князем стал Гедимин, который включил Берестейские и Мстиславские земли.\n'
                'c) Первым Великим Князем стал Войшелке, который включил Витебские земли.',

                'question 4': '<b>Каким образом происходило вхождение белорусских земель в состав Великого Княжества Литовского?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Путем приглашения правителей ВКЛ и заключения специальных договоров.\n'
                'b) В результате династических браков и наследования земель.\n'
                'c) В ходе завоевательных походов Великих князей, объединяя различные земли.',

                'question 5': '<b>Какая доля населения Великого Княжества Литовского принадлежала к белорусскому этносу?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Примерно 1/4 населения ВКЛ.\n'
                'b) Примерно 1/2 населения ВКЛ.\n'
                'c) Примерно 3/4 населения ВКЛ.\n'
                },
    'ticket 5': {
                'question 1': '<b>Какие были причины появления крестоносцев на территории Прибалтики и Беларуси?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) Поддержка и распространение христианства, а также рост влияния католической церкви.\n'
                 'b) Расширение торговых отношений и экономические выгоды.\n'
                 'c) Политические интересы и стремление к власти в Восточной Европе.',

                'question 2': '<b>Какие события характеризовали борьбу с крестоносцами в период правления Гедимина, Ольгерда и Кейстута?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) Стабилизация положения Великого Княжества Литовского и поражение крестоносцев.\n'
                 'b) Нарастающая активизация крестоносцев и внутриполитическая борьба в ВКЛ.\n'
                 'c) Сотрудничество ВКЛ с Тевтонским орденом для борьбы с крестоносцами.',

                'question 3': '<b>Что произошло в ходе "Великой войны" и каковы были её последствия?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) Война завершилась миром, в результате которого крестоносцы вернули захваченные земли и выплатили деньги победителям.\n'
                 'b) Победа союзных войск Великого Княжества Литовского и Польши, после чего они осадили Мальборк, но осада оказалась неудачной.\n'
                 'c) Крестоносцы обеспечили себе контроль над всеми землями Прибалтики и Беларуси.',

                'question 4': '<b>Какие личности, такие как Владимир Полоцкий и Давыд Городенский, внесли значительный вклад в борьбу с крестоносцами?</b>\n'
                 'a) Владимир Полоцкий совершил ряд успешных походов против агрессоров.\n'
                 'b) Давыд Городенский отличился в обороне Гродно и Новогрудка от крестоносцев.\n'
                 'c) Оба варианта верны.',

                'question 5': '<b>Что означала победа союзных войск Великого Княжества Литовского и Польши в Грюнвальдской битве?</b>\n'
                 'a) Поражение Тевтонского ордена и крах 200-летней агрессии крестоносцев в Прибалтике и Беларуси.\n'
                 'b) Установление долгосрочного мира и сотрудничества с Тевтонским орденом.\n'
                 'c) Потеря влияния на Востоке Европы и усиление Тевтонского ордена.'
                },
    
    'ticket 6': {
                'question 1': '<b>Когда Франциск Скорина окончил факультет вольных искусств в Краковском университете?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) В 1490 году.\n'
                 'b) В 1512 году.\n'
                 'c) В 1551 году.',
                 
                'question 2': '<b>Где Франциск Скорина основал первую типографию и издал первое печатное издание в истории белорусского и восточнославянского книгопечатания?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) В Полоцке.\n'
                 'b) В Минске.\n'
                 'c) В Праге.',
                 
                'question 3': '<b>Что стало основным содержанием изданий Франциска Скорины?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) Тексты других авторов без его предисловий и послесловий.\n'
                 'b) Каменные орудия и керамика.\n'
                 'c) Тексты автора с его предисловиями и гравюрами.',
                 
                'question 4': '<b>Почему издания Франциска Скорины вызывали осуждение в церковной среде?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) Издания содержали тексты, не связанные с религиозными темами.\n'
                 'b) Франциск Скорина был атеистом.\n'
                 'c) Издания содержали его портреты и предисловия, нарушая устоявшиеся правила.',
                 
                'question 5': '<b>Какое значение имел Франциск Скорина в белорусской культуре и образовании?</b>\n'
                 'Выберите вариант ответа:\n'
                 'a) Его деятельность не оказала влияния на белорусскую культуру.\n'
                 'b) Франциск Скорина был основателем белорусской письменности и образования.\n'
                 'c) Он был известным политиком, но не связанным с культурой и образованием.'
                },
    
    'ticket 7': {
                'question 1': '<b>Каковы были основные причины начала войны 1812 года на территории Беларуси?</b>\n'
                'Выберите правильный ответ:\n'
                'a) Наполеон пытался завоевать Россию и установить контроль над её территорией.\n'
                'b) Шляхта активно поддерживала Россию в этой войне.\n'
                'c) Франция и Россия заключили мир и прекратили вражду в этот период.\n',

                'question 2': '<b>Какое влияние оказали местные шляхтенные землевладельцы на ход войны?</b>\n'
                'Выберите правильный ответ:\n'
                'a) Шляхта присоединилась к русской армии и поддержала Александра I.\n'
                'b) Часть шляхты создала собственные военные отряды и сражалась на стороне Наполеона.\n'
                'c) Шляхта оставалась нейтральной и не принимала активного участия в конфликте.\n',

                'question 3': '<b>Какое влияние оказала война на местное население и экономику Беларуси?</b>\n'
                'Выберите правильный ответ:\n'
                'a) Экономическое положение хозяйства значительно улучшилось, и население стало более процветающим.\n'
                'b) Множество деревень и городов были разграблены или разрушены, и местное население было вынуждено бежать.\n'
                'c) Крестьяне получили свободу и полные гражданские права после окончания войны.\n',

                'question 4': '<b>Какие меры предприняло население Беларуси для борьбы против французской армии?</b>\n'
                'Выберите правильный ответ:\n'
                'a) Купцы и мещане обеспечивали французскую армию всем необходимым.\n'
                'b) Местное население организовывало партизанские отряды и нападало на французские гарнизоны и обозы.\n'
                'c) Шляхта активно сотрудничала с французскими войсками, предоставляя им ресурсы и войска.\n',

                'question 5': '<b>Как завершилась война 1812 года и какие итоги она принесла для Беларуси?</b>\n'
                'Выберите правильный ответ:\n'
                'a) Наполеон одержал победу и включил Беларусь в состав Франции.\n'
                'b) Война закончилась тотальным поражением французской армии, и Беларусь вернулась под власть Российской империи.\n'
                'c) Война завершилась мирным соглашением, и Беларусь стала независимым государством.\n'
                },
    
    'ticket 8': {
                'question 1': '<b>Какие элементы оставались отдельными для Польши и Великого Княжества Литовского в результате Люблинской унии?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Армия\n'
                    'b) Правительственный аппарат\n'
                    'c) Печать',

                    'question 2': '<b>Какой орган становился высшим органом власти в Речи Посполитой после Люблинской унии?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Монарх\n'
                    'b) Аристократия\n'
                    'c) Общий сейм',

                    'question 3': '<b>Какая война и с кем велась после 1558 года стала одной из причин, почему Великое Княжество Литовское обратилось за помощью к Польше и привела к Люблинской унии?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Ливонская война\n'
                    'b) Тридцатилетняя война\n'
                    'c) Семилетняя война',

                    'question 4': '<b>Какое событие послужило началом процесса "полонизации" в Великом Княжестве Литовском после Люблинской унии?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Восстание крестьян\n'
                    'b) Создание Трибунала Великого Княжества Литовского\n'
                    'c) Первый польский король',

                    'question 5': '<b>Какой документ, принятый в 1588 году, подтверждал самостоятельность Великого Княжества Литовского после Люблинской унии?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Люблинский договор\n'
                    'b) Статут Великого Княжества Литовского 1588 года\n'
                    'c) Пакт конвента Речи Посполитой',
                },
    
    'ticket 9': {
                'question 1': '<b>Что характеризует народность как историческую общность?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Единый монарх\n'
                    'b) Единство происхождения, языка, территории, культуры\n'
                    'c) Однородная религиозная вера',

                'question 2': '<b>Какое племя считается этнической основой белорусской народности?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Дреговичи, кривичи, радимичи\n'
                    'b) Поляне'
                    'c) Варяги',

                'question 3': '<b>Какие факторы способствовали формированию белорусской народности?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Распространение крестьянства\n'
                    'b) Объединение белорусских земель в Великом Княжестве Литовском\n'
                    'c) Географическое положение в центре Европы',

                'question 4': '<b>Какими признаками проявилось формирование белорусской народности в языке?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Старославянский язык\n'
                    'b) Русский язык',
                    'c) Старобелорусский язык и его особенности\n'

                'question 5': '<b>Версия происхождением названия «Белая Русь»?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Связана с направлением сторон света\n'
                    'b) Связана с цветом одежды и внешностью белорусов\n'
                    'c) Связана с религиозным вероисповеданием',
                },
    
    'ticket 10': {
                'question 1': '<b>По какой причине российские власти рассматривали отмену крепостного права?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Отмена крепостного права ускорила индустриализацию\n'
                    'b) Крестьяне грозили восстанием\n'
                    'c) Следование западноевропейским трендам',

                'question 2': '<b>Какие губернии были первыми в внедрении реформы об отмене крепостного права?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Московская и Тамбовская\n'
                    'b) Западные губернии с товарно-денежными отношениями\n'
                    'c) Все губернии одновременно',

                'question 3': '<b>Что включал в себя Манифест Александра II об отмене крепостного права?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Крестьяне получили землю бесплатно\n'
                    'b) Крестьяне получили личную свободу, но не землю\n'
                    'c) Крестьяне получили всю землю бывших помещиков',

                'question 4': '<b>Что означало понятие "надел" для крестьян в рамках реформы?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Срок выкупа земли увеличен до 99 лет\n'
                    'b) Крестьяне могли выбирать, какую землю покупать\n'
                    'c) Земля, отданная крестьянам, определялась помещиком',

                'question 5': '<b>Каким образом крестьяне выплачивали сумму за землю по реформе?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Крестьяне не были обязаны платить за землю\n'
                    'b) Сумма платы включала проценты и распределялась между помещиком и государством\n'
                    'c) Государство платило помещику, а крестьяне платили государству'
                },
    
    'ticket 11': {
                'question 1': '<b>Что послужило одной из причин Революции 1905–1907 гг. в России?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Отмена крепостного права\n'
                    'b) Наличие конституционной монархии\n'
                    'c) Преобразование в диктатуру пролетариата',

                'question 2': '<b>Какую роль играли буржуазно-либеральные силы в Революции 1905–1907 гг.?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Стремились к социалистическим преобразованиям\n'
                    'b) Поддерживали конституционную монархию\n'
                    'c) Выступали за установление диктатуры пролетариата',

                'question 3': '<b>Что произошло в Минске 18 октября 1905 г.?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Расстрелян мирный митинг\n'
                    'b) Провозглашена автономия Беларуси\n'
                    'c) Состоялись выборы в Государственную Думу',

                'question 4': '<b>Какие результаты достигла Революция 1905–1907 гг. в России?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Освобождение крестьян и установление демократии\n'
                    'b) Ослабление самодержавия и введение диктатуры пролетариата\n'
                    'c) Решение аграрного и национального вопросов',

                'question 5': '<b>Что произошло после третьеиюньского государственного переворота?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Власть перешла в руки Временного правительства\n'
                    'b) Началась Вторая Мировая война\n'
                    'c) Россия стала республикой',
                },
    
    'ticket 12': {
                'question 1': '<b>Какие страны столкнулись в Первой Мировой войне?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Германия, Россия, Франция\n'
                    'b) Германия, Австро-Венгрия, Италия\n'
                    'c) Германия, Австро-Венгрия, Россия, Франция, Англия',

                'question 2': '<b>Какое отношение население Беларуси имело к началу Первой Мировой войны?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Оно поддерживало войну с Германией и Австро-Венгрией\n'
                    'b) Оно активно выступало против войны\n'
                    'c) Оно игнорировало события военного времени',

                'question 3': '<b>Какие последствия пришлись на Беларусь в ходе Первой Мировой войны?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Беларусь осталась не затронутой войной\n'
                    'b) Беларусь была оккупирована немецкими войсками\n'
                    'c) Беларусь стала центром военных операций',

                'question 4': '<b>Что произошло с Брестом в ходе Первой Мировой войны?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Брест стал столицей нового государства\n'
                    'b) Брест был оккупирован немецкими войсками\n'
                    'c) Брест остался под контролем русских войск',

                'question 5': '<b>Какой документ был подписан в Бресте в 1918 году и какие территории потеряла Советская Россия?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Подписан мирный договор, и Советская Россия потеряла часть своей территории\n'
                    'b) Подписан союзный договор, и никакие территории не были утрачены\n'
                    'c) Подписан договор о дружбе, и Советская Россия не потеряла территорий',
                },
    
    'ticket 13': {
                'question 1': '<b>Какие факторы привели к началу антиправительственных выступлений в России в феврале 1917 года?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Экономические и социальные трудности, неудачи на фронте\n'
                    'b) Проведение реформы власти\n'
                    'c) Политические конфликты с другими странами',

                'question 2': '<b>Какие органы власти сформировали большевики на территории Беларуси после свержения царского правительства?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Временное правительство\n'
                    'b) Областной исполнительный комитет и Совет Народных Комисаров\n'
                    'c) Советы рабочих и солдатских депутатов',

                'question 3': '<b>Какие первоочередные меры предприняли большевики после прихода к власти в Беларуси?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Национализация промышленности, введение 8-часового рабочего дня, реализация Декрета о земле\n'
                    'b) Подавление прав рабочих\n'
                    'c) Приватизация земли и промышленных предприятий',

                'question 4': '<b>Что объявила "Декларация прав народов России"?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Право на свободу слова и выражение мнения\n'
                    'b) Право на национальное самоопределение и образование собственных государств\n'
                    'c) Право на свободу передвижения',

                'question 5': '<b>Чему посвящен День Октябрьской революции, объявленный праздничным в Республике Беларусь?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Дню свержения большевиками Временного правительства\n'
                    'b) Дню провозглашения независимости Беларуси\n'
                    'c) Дню свержения самодержавия',
                },
    
    'ticket 14': {
                'question 1': '<b>Что способствовало принятию большевиками решения о создании белорусской государственности?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Надежда на мировую социалистическую революцию\n'
                    'b) Активизация национального движения в Беларуси\n'
                    'c) Немецкая оккупация территории Беларуси',

                'question 2': '<b>Какое событие способствовало провозглашению Манифеста об образовании ССРБ?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Окончание Всебелорусского съезда\n'
                    'b) Уход немецких войск с территории Беларуси\n'
                    'c) Переезд правительства ССРБ в Минск',

                'question 3': '<b>Что стало следующим шагом после освобождения Беларуси от польских интервентов?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Создание ЛитБела\n'
                    'b) Второе провозглашение ССРБ в Минске\n'
                    'c) Формирование временного правительства Беларуси',

                'question 4': '<b>Какие государства стали пограничными зонами между РСФСР и Польшей?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) ССРБ и ЛитБел\n'
                    'b) ССРБ и Украина\n'
                    'c) ЛитБел и Украина',

                'question 5': '<b>Что считается важнейшим шагом в официальном оформлении белорусской государственности?</b>\n'
                    'Выберите правильный ответ:\n'
                    'a) Созыв Всебелорусского съезда\n'
                    'b) Второе провозглашение ССРБ\n'
                    'c) Окончательное решение о провозглашении белорусской государственности',
                },
    
    'ticket 15': {
                'question 1': '<b>Какие были основные причины начала Советско-Польской войны 1919–1921 гг.?</b>\n'
                'Выберите правильный ответ:\n'
                  'a) Желание Польши восстановить бывшие территории Речи Посполитой.\n'
                  'b) Стремление Советской России захватить Германию.\n'
                  'c) Экономические разногласия между Польшей и Россией.\n',

                'question 2': '<b>Какой фронт стабилизировался летом 1919 года в ходе войны?</b>\n'
                'Выберите правильный ответ:\n'
                  'a) Фронт стабилизировался на реке Висла.\n'
                  'b) Фронт стабилизировался на реке Березина.\n'
                  'c) Война не привела к стабилизации фронта.\n',

                'question 3': '<b>Какую политику проводило польское руководство на оккупированных территориях?</b>\n'
                'Выберите правильный ответ:\n'
                  'a) Политика полонизации и ассимиляции белорусского населения.\n'
                  'b) Поддержка советской власти и культуры.\n'
                  'c) Политика нейтралитета и невмешательства.\n',

                'question 4': '<b>Как завершилась Советско-Польская война с точки зрения территориальных изменений?</b>\n'
                'Выберите правильный ответ:\n'
                  'a) Беларусь стала независимым государством.\n'
                  'b) Беларусь была поделена между Польшей и Россией.\n'
                  'c) Польша полностью присоединила Беларусь.\n',

                'question 5': '<b>Какие последствия для Беларуси и белорусского народа были в результате Советско-Польской войны?</b>\n'
                'Выберите правильный ответ:\n'
                  'a) Беларусь была объединена в одном государстве с Польшей.\n'
                  'b) Беларусь оказалась разделенной между Польшей и Россией.\n'
                  'c) Беларусь стала независимым государством без потерь.\n',
                },
    
    'ticket 16': {
                'question 1': '<b>Какие основные мероприятия включала в себя политика белорусизации в БССР в 1920-1930-е гг.?</b>\n'
                  'Выберите вариант ответа:\n'
                  'a) Продвижение русского языка как официального языка.\n'
                  'b) Перевод обучения в школах преимущественно на белорусский язык и расширение его использования.\n'
                  'c) Ограничение использования белорусского языка во всех сферах общества.\n',

                'question 2': '<b>Какие результаты дала политика белорусизации в БССР в 1920-1930-е гг.?</b>\n'
                  'Выберите вариант ответа:\n'
                  'a) Снижение использования белорусского языка и культуры.\n'
                  'b) Значительное расширение использования белорусского языка как в жизни, так и на официальном уровне, а также развитие белорусской культуры и литературы.\n'
                  'c) Прекращение использования белорусского языка в любых сферах общества.\n',

                'question 3': '<b>Какими основными событиями было связано становление белорусской советской государственности?</b>\n'
                  'Выберите вариант ответа:\n'
                  'a) Советско-польская война и присоединение Беларуси к СССР.\n'
                  'b) Белорусская революция и восстановление независимого государства.\n'
                  'c) Союз с Германией и воссоединение с Речью Посполитой.\n',

                'question 4': '<b>Какими достижениями в образовании и науке были знамениты белорусские ученые в 1920-1930-е гг.?</b>\n'
                  'Выберите вариант ответа:\n'
                  'a) Отсутствие значительных достижений в науке и образовании.\n'
                  'b) Ликвидация неграмотности, открытие школ и учебных заведений, развитие белорусоведения и освоение Северного морского пути.\n'
                  'c) Исключительное внимание к искусству и неграмотности взрослого населения.\n',

                'question 5': '<b>Какие достижения в литературе и искусстве были характерны для белорусской культуры в 1920-1930-е гг.?</b>\n'
                  'Выберите вариант ответа:\n'
                  'a) Отсутствие значительных произведений литературы и искусства.\n'
                  'b) Развитие литературы с работами таких авторов, как Д. Ф. Жилунович, Максим Горецкий и Кузьма Чорный, а также активное развитие театра и кино.\n'
                  'c) Благополучие культуры, но отсутствие интереса к литературе и искусству.\n',
                },
    
    'ticket 17': {
                'question 1': '<b>Какие причины привели к проведению индустриализации в БССР во второй половине 1920-х – 1930-е гг.?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Необходимость обеспечения городов сельскохозяйственным сырьем и продукцией для индустриализации.\n'
                    'b) Стремление создать крупное машинное производство только в тяжелой промышленности.\n'
                    'c) Западная Беларусь находилась в составе Польши, что исключило индустриализацию в этом регионе.\n',

                'question 2': '<b>Что являлось особенностью проведения индустриализации в Восточной Беларуси?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Развитие тяжелой промышленности в первую очередь.\n'
                    'b) Активное использование местных природных ресурсов, таких как лес и торф.\n'
                    'c) Участие всей территории Беларуси в индустриализации.\n',

                'question 3': '<b>Каким образом проводилась индустриализация в БССР?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) По пятилетним планам с форсированными темпами.\n'
                    'b) Индивидуально для каждого региона без общих планов.\n'
                    'c) Без учета количественных и качественных показателей.\n',

                'question 4': '<b>Каким образом преодолевались технологическая и экономическая отсталость в БССР?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) За счет развития легкой промышленности и широкого использования местных ресурсов.\n'
                    'b) Путем перевода деревни на рельсы крупного машинного производства.\n'
                    'c) Благодаря многостаночному обслуживанию и социалистическим соревнованиям.\n',

                'question 5': '<b>Какие последствия имела индустриализация для БССР?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Сохранение структуры сельского хозяйства и отсутствие экономического роста.\n'
                    'b) Преобразование страны в индустриально-аграрное государство с модернизацией производства и ростом экономики.\n'
                    'c) Завершение коллективизации и отказ от индустриализации.\n',
                },
    
    'ticket 18': {
                'question1': '<b>Какое название получила Западная Беларусь в официальных польских документах после Рижского мирного договора в 1921 году?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Западная Украина\n'
                    'b) Кресы восточные\n'
                    'c) Полесье\n',
                
                'question 2': '<b>Какой политический режим установился в Польше на рубеже 20-х и 30-х годов?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Демократия\n'
                    'b) Военно-авторитарный режим\n'
                    'c) Монархия\n',
                
                'question 3': '<b>Какие проблемы столкнулись сельские жители Западной Беларуси из-за политики польских властей?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Экономический кризис\n'
                    'b) Большой рост рабочей силы\n'
                    'c) Эксплуатация и лишение земли\n',
                    
                'question 4': '<b>Что предпринимали местные культурные организации, такие как Товарищество белорусской школы (ТБШ), в борьбе против полонизации?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Организовывали партизанские отряды\n'
                    'b) Осуществляли создание колхозов\n'
                    'c) Открывали белорусскоязычные школы и культурные учреждения\n',
                
                'question 5': '<b>Какое восстание стало ярким примером народной борьбы против польских ограничений в 1935 году?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Новогрудское восстание\n'
                    'b) Минское восстание\n'
                    'c) Нарочанское восстание\n',
                },
    
    'ticket 19': {
                'question 1': '<b>Какие главные цели нацистской Германии были связаны с войной против Советского Союза в 1941 году?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Опустошение Сибири\n'
                    'b) Присоединение к СССР\n'
                    'c) Расширение территории и разрушение советской системы\n',
                
                'question 2': '<b>Почему Красная Армия не была должным образом подготовлена к обороне на западном направлении в начале Великой Отечественной войны?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Советское руководство считало войну маловероятной\n'
                    'b) Красная Армия была слабо вооружена\n'
                    'c) Советские войска были разгромлены в первые дни войны\n',
                
                'question 3': '<b>Какие крепости и города Беларуси стали местами героической обороны в начале Великой Отечественной войны?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Брестская крепость, Могилев, Орша\n'
                    'b) Минск, Витебск, Гомель\n'
                    'c) Гродно, Бобруйск, Барановичи\n',
                
                'question 4': '<b>Какие подвиги совершили индивидуальные военнослужащие в начале войны?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Взрыв боевой техники врага и выбивание своих из окружения\n'
                    'b) Организация партизанских отрядов\n'
                    'c) Отступление на запад\n',
                
                'question 5': '<b>Какие результаты достигла Красная Армия в начальном этапе оборонительных боев в Беларуси?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Был разгромлен враг и прекращено наступление на Москву\n'
                    'b) Полное отступление на запад и потеря территорий\n'
                    'c) Оборона была организована эффективно\n',
                },
    
    'ticket 20': {
                'question 1': '<b>Какая античеловеческая и антигуманная сущность воплощала в себе германская оккупация на оккупированных территориях?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Уважение и защита прав человека\n'
                'b) Стремление к сотрудничеству и развитию местного населения\n'
                'c) Политика уничтожения и угнетения национальных народов\n',
    
                'question 2': '<b>В плане "Ост" предусматривалось уничтожить какую долю белорусского населения на занимаемой территории?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) 25%\n'
                    'b) 50%\n'
                    'c) 75%\n',
    
                'question 3': '<b>Какие мероприятия вводил немецкий "новый порядок" на оккупированных территориях?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Поддержание существовавших местных структур\n'
                    'b) Улучшение экономического положения местного населения\n'
                    'c) Ликвидация советского строя и угнетение гражданского населения\n',
    
                'question 4': '<b>Какие последствия несло за собой отказ от работы на заводах и фабриках во времена оккупации?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Перевод в ранг немецких господ\n'
                    'b) Исключение из обязанности работать и получение высоких пособий\n'
                    'c) Смерть или отправка в концлагерь\n',
    
                'question 5': '<b>В какие рейхскомиссариаты входила территория Беларуси во времена оккупации?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Рейхскомиссариат "Украина"\n'
                    'b) Рейхскомиссариат "Остланд"\n'
                    'c) Генеральный округ "Беларусь"\n',
                },
    
    'ticket 21': {
                'question 1': '<b>Какая античеловеческая и антигуманная сущность воплощала в себе германская оккупация на оккупированных территориях?</b>\n'
                'Выберите вариант ответа:\n'
                'a) Уважение и защита прав человека\n'
                'b) Стремление к сотрудничеству и развитию местного населения\n'
                'c) Политика уничтожения и угнетения национальных народов\n',
                
                'question 2': '<b>В каком периоде происходило восстановление БССР и выход на довоенные показатели в промышленности?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) 1950–1955 гг.\n'
                    'b) 1960–1965 гг.\n'
                    'c) 1970–1975 гг.\n',
                
                'question 3': '<b>Что было направлено на ликвидацию в сельском хозяйстве БССР во второй половине 1950-х гг.?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Советский строй\n'
                    'b) Мелиорация болот\n'
                    'c) Многоотраслевые хозяйства\n',
                
                'question 4': '<b>Какие отрасли промышленности были акцентированы на развитие в 60-х гг.?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Легкая промышленность\n'
                    'b) Тяжелая промышленность\n'
                    'c) Производство средств связи\n',
                
                'question 5': '<b>Какими проблемами столкнулась БССР в 70-е – 80-е гг. в связи с развитием промышленности?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Недостаток химических удобрений\n'
                    'b) Быстрый рост цветной телевизоров\n'
                    'c) Ограничение производства видеотехники\n',
                },
    
    'ticket 22': {
                'question 1': '<b>Какое событие ознаменовало завершение перехода на всеобщее семилетнее обучение в БССР?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Открытие Гродненского сельскохозяйственного института\n'
                    'b) Реформа в системе образования\n'
                    'c) Подготовка педагогических кадров для рабочей молодёжи\n',
                  
                'question 2': '<b>Какой процесс развития системы образования был связан с формированием индустриального общества?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Процесс внедрения научных достижений в производство\n'
                    'b) Переход к всеобщему среднему образованию\n'
                    'c) Расширение сети профессионально-технических училищ\n',
                  
                'question 3': '<b>Какие достижения в области науки можно отнести к белорусской деятельности во второй половине 1940-х–1980-е гг.?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Успехи в сельскохозяйственных технологиях\n'
                    'b) Развитие радиоэлектроники и микроэлектроники\n'
                    'c) Участие уроженцев Беларуси в космических исследованиях\n',
                  
                'question 4': '<b>Какое произведение литературы описывает судьбу народа во время войны?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Роман «Млечный путь» Кузьмы Чорного\n'
                    'b) Роман «Глубокое течение» Ивана Шамякина\n'
                    'c) Роман «Минское направление» Ивана Мележа\n',
                    
                'question 5': '<b>Какие тематики в изобразительном искусстве послевоенных лет были наиболее популярны?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Военная тематика и события революционных лет\n'
                    'b) Сельская жизнь в 1920-1930-е гг.\n'
                    'c) Жизнь простого человека в условиях войны\n'
                },
    
    'ticket 23': {
                'question 1': '<b>Какое событие ознаменовало начало процесса оформления государственного суверенитета Беларуси?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Подписание Беловежских соглашений\n'
                    'b) Прием в ООН\n'
                    'c) Принятие новой Конституции\n',
    
                'question 2': '<b>Когда была принята Конституция Республики Беларусь?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) 15 марта 1994 г.\n'
                    'b) 27 июля 1990 г.\n'
                    'c) 14 мая 1995 г.\n',
    
                'question 3': '<b>Какая должность была введена в Беларуси после принятия Конституции Республики Беларусь?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Глава Правительства\n'
                    'b) Президент Республики Беларусь\n'
                    'c) Председатель Верховного Совета\n',
    
                'question 4': '<b>Какие события обозначены на государственном гербе Республики Беларусь?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Красные и зеленые полосы\n'
                    'b) Снопы колосьев\n'
                    'c) Очертание Республики Беларусь\n',
    
                'question 5': '<b>Какое событие было свидетельством укрепления президентской власти в Беларуси?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Беловежские соглашения\n'
                    'b) Референдум 1996 года\n'
                    'c) Введение Президента в 1991 году\n'
                },
    
    'ticket 24': {
                'question 1': '<b>Какое событие ознаменовало начало процесса оформления государственного суверенитета Беларуси?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Подписание Беловежских соглашений\n'
                    'b) Прием в ООН\n'
                    'c) Принятие новой Конституции\n',
                'question 2': '<b>Что было подписано 8 декабря 1991 года в Беловежской пуще?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Договор о создании СНГ\n'
                    'b) Декларация о государственном суверенитете\n'
                    'c) Парижская хартия\n',
                'question 3': '<b>Какие принципы внешней политики подчеркивает Республика Беларусь в тексте?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Равенство государств, нерушимость границ и неприменение силы\n'
                    'b) Экономическая доминирование\n'
                    'c) Военная агрессия\n',
                'question 4': '<b>С какой страной Республика Беларусь установила наиболее тесные внешнеполитические связи?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Китай\n'
                    'b) Российская Федерация\n'
                    'c) Германия\n',
                'question 5': '<b>Какое внешнеполитическое объединение было образовано 2 апреля 1997 года между Беларусью и Россией?</b>\n'
                    'Выберите вариант ответа:\n'
                    'a) Европейский союз\n'
                    'b) Союз Беларуси и России\n'
                    'c) НАТО\n',
                },
    
    'ticket 25': {
                'question 1': '<b>Что является приоритетом государственной политики в Республике Беларусь?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Развитие сельского хозяйства\n'
                    'b) Создание наукоемких высокотехнологических производств\n'
                    'c) Разработка социальных программ\n',

                'question 2': '<b>Какой процент ВВП формирует промышленный комплекс в Республике Беларусь?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) 27,1%\n'
                    'b) 50%\n'
                    'c) 75–80%\n',

                'question 3': '<b>Что является основой национальной экономики Республики Беларусь?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Промышленный комплекс\n'
                    'b) Сельское хозяйство\n'
                    'c) Финансовый сектор\n',

                'question 4': '<b>Какие товарные позиции славятся белорусской промышленностью?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Карьерные самосвалы «БЕЛАЗ» и детские игрушки\n'
                    'b) Металлургическая и химическая отрасли\n'
                    'c) Пищевая и мебельная продукция\n',

                'question 5': '<b>Какие предприятия формируют почти половину промышленного производства в Республике Беларусь?</b>\n'
                'Выберите вариант ответа:\n'
                    'a) Частные предприятия\n'
                    'b) Государственные предприятия\n'
                    'c) Международные корпорации\n',
                }
}